SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `mukhinnnik`
--

-- --------------------------------------------------------

--
-- Структура таблицы `pvk`
--

CREATE TABLE `pvk` (
  `id` int NOT NULL,
  `category` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `pvk`
--

INSERT INTO `pvk` (`id`, `category`, `name`) VALUES
(1, 'Ценностно-побудительные качества личности', 'Готовность к защите Родины с оружием в руках'),
(2, 'Ценностно-побудительные качества личности', 'Военно-профессиональная направленность'),
(3, 'Ценностно-побудительные качества личности', 'Прямые внутренние мотивы военно-профессиональной деятельности'),
(4, 'Ценностно-побудительные качества личности', 'Стремление к профессиональному совершенству'),
(5, 'Регуляторные качества личности', 'Адекватная самооценка'),
(6, 'Регуляторные качества личности', 'Самостоятельность \r\n'),
(7, 'Регуляторные качества личности', 'Пунктуальность, педантичность'),
(8, 'Регуляторные качества личности', 'Дисциплинированность\r\n'),
(9, 'Регуляторные качества личности', 'Аккуратность в работе'),
(10, 'Регуляторные качества личности', 'Организованность, самодисциплина'),
(11, 'Регуляторные качества личности', 'Старательность, исполнительность'),
(12, 'Регуляторные качества личности', 'Ответственность'),
(13, 'Регуляторные качества личности', 'Трудолюбие '),
(14, 'Регуляторные качества личности', 'Инициативность'),
(15, 'Регуляторные качества личности', 'Самокритичность'),
(16, 'Регуляторные качества личности', 'Оптимизм, доминирование положительных эмоций'),
(17, 'Регуляторные качества личности', 'Самообладание, эмоциональная уравновешенность, выдержка\r\n'),
(18, 'Регуляторные качества личности', 'Самоконтроль, способность к самонаблюдению'),
(19, 'Регуляторные качества личности', 'Предусмотрительность'),
(20, 'Регуляторные качества личности', 'Фрустрационная толерантность (отсутствие агрессивности или депрессивности в ситуациях неудач)\r\n'),
(21, 'Регуляторные качества личности', 'Самомобилизующийся тип реакции на препятствия, возникающие на пути к достижению цели.'),
(22, 'Регуляторные качества личности', ' Интернальность (погруженность в себя, самодостаточность, необщительность)'),
(23, 'Регуляторные качества личности', ' Экстернальность (ориентация на взаимодействие с людьми, общительность)'),
(24, 'Регуляторные качества личности', 'Интрапунитивность (ориентация на собственные силы, уверенность в себе, чувство самоэффективности)'),
(25, 'Регуляторные качества личности', 'Экстрапунитивность (ориентация на помощь других людей, надежда на благоприятные обстоятельства, неуверенность в себе)'),
(26, 'Регуляторные качества личности', 'Способность планировать свою деятельность во времени'),
(27, 'Регуляторные качества личности', 'Способность организовывать свою деятельность в условиях большого потока информации и разнообразия поставленных задач'),
(28, 'Регуляторные качества личности', 'Способность брать на себя ответственность за принимаемые решения и действия\r\n'),
(29, 'Регуляторные качества личности', 'Способность принимать решение в нестандартных ситуациях'),
(30, 'Регуляторные качества личности', 'Способность рационально действовать в экстремальных ситуациях'),
(31, 'Регуляторные качества личности', 'Способность эффективно действовать (также быстро принимать решения) в условиях дефицита времени'),
(32, 'Регуляторные качества личности', 'Способность переносить неприятные ощущения (дурной запах, шум, грязь, холодная вода, ожог, царапина, удар электрического тока и т.д.) без потрясений'),
(33, 'Регуляторные качества личности', 'Способность аргументировано отстаивать свое мнение'),
(34, 'Регуляторные качества личности', 'Способность к переключениям с одной деятельности на другую'),
(35, 'Регуляторные качества личности', 'Способность преодолевать страх'),
(36, 'Индивидуально-типологические ПВК', 'Решительность'),
(37, 'Индивидуально-типологические ПВК', 'Сильная воля'),
(38, 'Индивидуально-типологические ПВК', 'Смелость'),
(39, 'Индивидуально-типологические ПВК', 'Чувство долга'),
(40, 'Индивидуально-типологические ПВК', 'Честность'),
(41, 'Индивидуально-типологические ПВК', 'Порядочность'),
(42, 'Индивидуально-типологические ПВК', 'Товарищество'),
(43, 'Свойства восприятия', 'Зрительная оценка размеров предметов'),
(44, 'Свойства восприятия', 'Зрительное восприятие расстояний между предметами'),
(45, 'Свойства восприятия', 'Глазомер: линейный, угловой, объемный'),
(46, 'Свойства восприятия', 'Глазомер динамический (способность оценивать направление и скорость движения предмета)'),
(47, 'Свойства восприятия', 'Способность к различению фигуры (предмета, отметки, сигнала и пр.) на малоконтрастном фоне'),
(48, 'Свойства восприятия', 'Способность различать и опознавать замаскированные объекты'),
(49, 'Свойства восприятия', 'Способность к восприятию пространственного соотношения предметов'),
(50, 'Свойства восприятия', 'Точность и оценка направления на источник звука'),
(51, 'Свойства восприятия', 'Способность узнавать и различать ритмы'),
(52, 'Свойства восприятия', 'Речевой слух (восприятие устной речи)'),
(53, 'Свойства восприятия', 'Различение отрезков времени'),
(54, 'Свойства восприятия', 'Способность к распознаванию небольших отклонений параметров технологических процессов от заданных значений по визуальным признакам'),
(55, 'Свойства восприятия', 'Способность к распознаванию небольших отклонений параметров технологических процессов от заданных значений по акустическим признакам'),
(56, 'Свойства восприятия', 'Способность к распознаванию небольших отклонений параметров технологических процессов от заданных значений по кинестетическим признакам'),
(57, 'Свойства представления и воображения', 'Способность к зрительным представлениям'),
(58, 'Свойства представления и воображения', ' Способность к пространственному воображению'),
(59, 'Свойства представления и воображения', 'Способность к образному представлению предметов, процессов и явлений'),
(60, 'Свойства представления и воображения', 'Способность наглядно представлять себе новое явление, ранее, не встречающееся в опыте, или старое, но в новых условиях'),
(61, 'Свойства представления и воображения', 'Способность к переводу образа в словесное описание'),
(62, 'Свойства представления и воображения', 'Способность к воссозданию образа по словесному описанию'),
(63, 'Функциональные свойства мышления', 'Аналитичность (способность выделять отдельные элементы действительности, способность к классификации)'),
(64, 'Функциональные свойства мышления', 'Синтетичность (способность к обобщениям, установлению связей, закономерностей, формирование понятий)'),
(65, 'Функциональные свойства мышления', 'Транссонантность (способность к актуализации и вовлечению в процесс мышления информации, хранящейся в памяти, ассоциативность мышления)'),
(66, 'Функциональные свойства мышления', 'Логичность'),
(67, 'Функциональные свойства мышления', 'Креативность (способность порождать необычные идеи, отклоняться от традиционных схем мышления)'),
(68, 'Функциональные свойства мышления', 'Оперативность (скорость мыслительных процессов, интеллектуальная лабильность)'),
(69, 'Функциональные свойства мышления', 'Объектные свойства мышления (информационный материал, используемый в процессе мышления)'),
(70, 'Функциональные свойства мышления', 'Предметность (объекты реального мира и их признаки)'),
(71, 'Функциональные свойства мышления', 'Образность (наглядные образы, схемы, планы и т.д.)'),
(72, 'Функциональные свойства мышления', 'Абстрактность (абстрактные образы, понятия)'),
(73, 'Функциональные свойства мышления', 'Вербальность (устная и письменная речь)'),
(74, 'Функциональные свойства мышления', 'Калькулятивность (цифровой материал)'),
(75, 'Свойства памяти', 'Зрительная долговременная память на лица'),
(76, 'Свойства памяти', 'Зрительная долговременная память на образы предметного мира'),
(77, 'Свойства памяти', 'Зрительная долговременная память на условные обозначения (знаки, символы, планы, схемы, графики)'),
(78, 'Свойства памяти', 'Зрительная долговременная память на  на цифры, даты'),
(79, 'Свойства памяти', 'Зрительная долговременная память на  на слова и фразы'),
(80, 'Свойства памяти', 'Зрительная долговременная память на на семантику текста'),
(81, 'Свойства памяти', 'Зрительная оперативная память на лица'),
(82, 'Свойства памяти', 'Зрительная оперативная память на образы предметного мира'),
(83, 'Свойства памяти', 'Зрительная оперативная память на условные обозначения (знаки, символы, планы, схемы, графики)\r\n'),
(84, 'Свойства памяти', 'Зрительная оперативная память на цифры,  даты'),
(85, 'Свойства памяти', 'Зрительная оперативная память на слова и фразы'),
(86, 'Свойства памяти', 'Зрительная оперативная память на семантику текста'),
(87, 'Свойства памяти', 'Слуховая долговременная память на голоса'),
(88, 'Свойства памяти', 'Слуховая долговременная память на цифры'),
(89, 'Свойства памяти', 'Слуховая долговременная память на условные сигналы'),
(90, 'Свойства памяти', 'Слуховая долговременная память на мелодии'),
(91, 'Свойства памяти', 'Слуховая долговременная память на семантику сообщений'),
(92, 'Свойства памяти', 'Слуховая оперативная память на цифры'),
(93, 'Свойства памяти', 'Слуховая оперативная память на семантику сообщений'),
(94, 'Свойства памяти', 'Кинестетическая (моторная) память на простые движения'),
(95, 'Свойства памяти', 'Кинестетическая (моторная) память на сложные движения'),
(96, 'Свойства памяти', 'Кинестетическая (моторная) память на положение и перемещение тела в пространстве'),
(97, 'Свойства памяти', 'Тактильная память'),
(98, 'Свойства памяти', 'Обонятельная память'),
(99, 'Свойства памяти', 'Вкусовая память'),
(100, 'Энергопластический потенциал индивида', 'Энергичность, витальность (активность)'),
(101, 'Энергопластический потенциал индивида', 'Умственная работоспособность'),
(102, 'Энергопластический потенциал индивида', 'Физическая работоспособность (выносливость)'),
(103, 'Энергопластический потенциал индивида', 'Нервно-эмоциональная устойчивость, выносливость по отношению к эмоциональным нагрузкам'),
(104, 'Свойства ощущений', 'Острота зрения'),
(105, 'Свойства ощущений', 'Адаптация зрения к темноте, свету'),
(106, 'Свойства ощущений', 'Контрастная чувствительность монохроматического зрения'),
(107, 'Свойства ощущений', 'Цветовая дифференциальная чувствительность'),
(108, 'Свойства ощущений', 'Устойчивость зрительной чувствительности во времени'),
(109, 'Свойства ощущений', 'Острота слуха'),
(110, 'Свойства ощущений', 'Контрастная чувствительность слуха'),
(111, 'Свойства ощущений', 'Слуховая дифференциальная чувствительность (способность различать: тембр, длительность, высоту, силу звука, ритм, фоновые или разнообразные шумы)'),
(112, 'Свойства ощущений', 'Переносимость длительно действующего звукового раздражителя'),
(113, 'Свойства ощущений', 'Чувствительность (осязание) пальцев'),
(114, 'Свойства ощущений', 'Вибрационная чувствительность'),
(115, 'Свойства ощущений', 'Мышечно-суставная чувствительность усилий или сопротивления'),
(116, 'Свойства ощущений', 'Ощущение равновесия'),
(117, 'Свойства ощущений', 'Ощущение ускорения'),
(118, 'Свойства ощущений', 'Обонятельная чувствительность'),
(119, 'Свойства ощущений', 'Способность узнавать и различать вкусовые ощущения'),
(120, 'Свойства внимания', 'Объем внимания (количество объектов, на которые может быть направлено внимание при их одновременном восприятии)'),
(121, 'Свойства внимания', 'Концентрированность внимания'),
(122, 'Свойства внимания', 'Устойчивость внимания во времени'),
(123, 'Свойства внимания', 'Переключаемость внимания (способность быстрого переключения внимания с одного объекта на другой или с одной деятельности на другую)'),
(124, 'Свойства внимания', 'Способность к распределению внимания между несколькими объектами или видами деятельности'),
(125, 'Свойства внимания', 'Помехоустойчивость внимания'),
(126, 'Свойства внимания', 'Способность подмечать изменения в окружающей обстановке, не сосредотачивая сознательно на них внимание'),
(127, 'Свойства внимания', 'Умение подмечать незначительные (малозаметные) изменения в исследуемом объекте, в показаниях приборов'),
(128, 'Свойства психомоторики', 'Способность реагировать на неожиданный зрительный сигнал посредством определённых движений'),
(129, 'Свойства психомоторики', 'Способность реагировать на неожиданный слуховой сигнал посредством определённых движений'),
(130, 'Свойства психомоторики', 'Согласованность движений с процессами восприятия (сложноорганизованная деятельность)'),
(131, 'Свойства психомоторики', 'Способность к сенсомоторному слежению за движущимся объектом'),
(132, 'Свойства психомоторики', 'Способность к выполнению мелких точных движений'),
(133, 'Свойства психомоторики', 'Способность к выполнению сложных двигательных действий (актов)'),
(134, 'Свойства психомоторики', 'Способность к выполнению плавных соразмерных движений'),
(135, 'Свойства психомоторики', 'Координация движений ведущей руки.'),
(136, 'Свойства психомоторики', 'Координация движений обеих рук.'),
(137, 'Свойства психомоторики', 'Координация движений рук и ног.'),
(138, 'Свойства психомоторики', 'Координация работы кистей рук и пальцев.'),
(139, 'Свойства психомоторики', 'Твердость руки, устойчивость кистей рук (низкий тремор)'),
(140, 'Свойства психомоторики', 'Умение быстро записывать'),
(141, 'Свойства психомоторики', 'Красивый почерк'),
(142, 'Свойства психомоторики', 'Физическая сила.'),
(143, 'Свойства психомоторики', 'Способность к быстрой выработке сенсомоторных навыков'),
(144, 'Свойства психомоторики', 'Способность к быстрой перестройке сенсомоторных навыков'),
(145, 'Свойства психомоторики', 'Пластичность и выразительность движений'),
(146, 'Свойства речи', 'Отсутствие дефектов речи, хорошая дикция.'),
(147, 'Свойства речи', 'Способность речевого аппарата к интенсивной и длительной работе.'),
(148, 'Свойства речи', 'Способность к изменению тембра.'),
(149, 'Свойства речи', 'Способность к изменению силы звучания.'),
(150, 'Физиологические ПВК  (Регуляторные качества организма):', 'Переносимость динамических физических нагрузок'),
(151, 'Физиологические ПВК  (Регуляторные качества организма):', 'Переносимость статических физических нагрузок'),
(152, 'Физиологические ПВК  (Регуляторные качества организма):', ' Быстрый переход из состояния покоя к интенсивной работе'),
(153, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности при недостатке сна'),
(154, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности при развивающемся утомлении'),
(155, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение бдительности в условиях однообразной деятельности (монотонии)'),
(156, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение бдительности в режиме ожидания '),
(157, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности в некомфортных температурных условиях\r\n'),
(158, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности в условиях знакопеременных перегрузок (в том числе укачивания)'),
(159, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности в условиях воздействия вибрации'),
(160, 'Физиологические ПВК  (Регуляторные качества организма):', ' Сохранение работоспособности в условиях воздействия разнонаправленных перегрузок'),
(161, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности в условиях гипо(гипер) барометрических колебаний'),
(162, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности в условиях пониженного парциального давления'),
(163, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности в условиях пониженного парциального давления'),
(164, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности в условиях ограничения возможностей удовлетворения базовых жизненных потребностей (голод, жажда, отдых, сексуальная потребность)'),
(165, 'Физиологические ПВК  (Регуляторные качества организма):', 'Сохранение работоспособности в разных природно-климатических условиях'),
(166, 'Физиологические ПВК  (Регуляторные качества организма):', 'Способность переадаптироваться к новым средовым условиям  '),
(167, 'Физические ПВК ( Морфологические качества индивида):', 'Антропометрические характеристики (в соответствии с требованиями профессии)'),
(168, 'Физические ПВК ( Морфологические качества индивида):', 'Особенности телосложения (в соответствии с требованиями профессии)'),
(169, 'Физические ПВК ( Морфологические качества индивида):', 'Хорошее общее физическое развитие – выносливость, координированность, сила, быстрота'),
(170, 'Физические ПВК ( Морфологические качества индивида):', 'Физическая подготовленность к воздействию неблагоприятных факторов профессиональной деятельности');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `pvk`
--
ALTER TABLE `pvk`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `pvk`
--
ALTER TABLE `pvk`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=171;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
